In [1]:
from pandas import Series, DataFrame
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
student_marks = {'name':['abc','def','ghi','bcd'],
                'physics':[94,95,80,78],
                'maths':[97,45,90,93],
                'chemistry':[93,89,85,96]}

In [3]:
data1 = DataFrame(student_marks)
data1

   chemistry  maths name  physics
0         93     97  abc       94
1         89     45  def       95
2         85     90  ghi       80
3         96     93  bcd       78

In [4]:
data2 = DataFrame(student_marks, columns=['name','physics','maths','chemistry'])
data2

  name  physics  maths  chemistry
0  abc       94     97         93
1  def       95     45         89
2  ghi       80     90         85
3  bcd       78     93         96

In [5]:
data2['physics']

0    94
1    95
2    80
3    78
Name: physics, dtype: int64

In [6]:
data2['maths'][1]

45

In [7]:
data2['maths'][:3]

0    97
1    45
2    90
Name: maths, dtype: int64

In [8]:
data2.loc[2]

name         ghi
physics       80
maths         90
chemistry     85
Name: 2, dtype: object

In [11]:
data2[['physics','maths','chemistry']]

   physics  maths  chemistry
0       94     97         93
1       95     45         89
2       80     90         85
3       78     93         96

In [13]:
data3 = DataFrame(student_marks, columns=['name','physics','maths','chemistry'],index=[10,34,23,45])
data3

   name  physics  maths  chemistry
10  abc       94     97         93
34  def       95     45         89
23  ghi       80     90         85
45  bcd       78     93         96

In [14]:
data3['physics'][[34,45]]

34    95
45    78
Name: physics, dtype: int64

In [15]:
data3[['physics','maths']]

    physics  maths
10       94     97
34       95     45
23       80     90
45       78     93

In [16]:
data3[['physics','maths']].loc[[34,45]]

    physics  maths
34       95     45
45       78     93

In [18]:
data4 = data3.drop('name',axis = 1)
data4.index.name = 'Roll No'
data4.columns.name = 'Marks'
data4

Marks    physics  maths  chemistry
Roll No
10            94     97         93
34            95     45         89
23            80     90         85
45            78     93         96